zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      <registers>
        <register>
          <name>TASKS_HFCLKSTART</name>
          <description>Start HFCLK clock source.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_HFCLKSTOP</name>
          <description>Stop HFCLK clock source.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_LFCLKSTART</name>
          <description>Start LFCLK clock source.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_LFCLKSTOP</name>
          <description>Stop LFCLK clock source.</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_CAL</name>
          <description>Start calibration of LFCLK RC oscillator.</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_CTSTART</name>
          <description>Start calibration timer.</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_CTSTOP</name>
          <description>Stop calibration timer.</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_HFCLKSTARTED</name>
          <description>HFCLK oscillator started.</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <register>
          <name>EVENTS_LFCLKSTARTED</name>
          <description>LFCLK oscillator started.</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <register>
          <name>EVENTS_DONE</name>
          <description>Calibration of LFCLK RC oscillator completed.</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <register>
          <name>EVENTS_CTTO</name>
          <description>Calibration timer timeout.</description>
          <addressOffset>0x110</addressOffset>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>HFCLKSTARTED</name>
              <description>Enable interrupt on HFCLKSTARTED event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFCLKSTARTED</name>
              <description>Enable interrupt on LFCLKSTARTED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Enable interrupt on DONE event.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTTO</name>
              <description>Enable interrupt on CTTO event.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>HFCLKSTARTED</name>
              <description>Disable interrupt on HFCLKSTARTED event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFCLKSTARTED</name>
              <description>Disable interrupt on LFCLKSTARTED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Disable interrupt on DONE event.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTTO</name>
              <description>Disable interrupt on CTTO event.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>HFCLKRUN</name>
          <description>Task HFCLKSTART trigger status.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Task HFCLKSTART trigger status.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotTriggered</name>
                  <description>Task HFCLKSTART has not been triggered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Task HFCLKSTART has been triggered.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>HFCLKSTAT</name>
          <description>High frequency clock status.</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Active clock source for the HF clock.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>Internal 16MHz RC oscillator running and generating the HFCLK clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>External 16MHz/32MHz crystal oscillator running and generating the HFCLK clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>State for the HFCLK.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>HFCLK clock not running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>HFCLK clock running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>LFCLKRUN</name>
          <description>Task LFCLKSTART triggered status.</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Task LFCLKSTART triggered status.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotTriggered</name>
                  <description>Task LFCLKSTART has not been triggered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Task LFCLKSTART has been triggered.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>LFCLKSTAT</name>
          <description>Low frequency clock status.</description>
          <addressOffset>0x418</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Active clock source for the LF clock.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>Internal 32KiHz RC oscillator running and generating the LFCLK clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>External 32KiHz crystal oscillator running and generating the LFCLK clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>Internal 32KiHz synthesizer from the HFCLK running and generating the LFCLK clock.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>State for the LF clock.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>LFCLK clock not running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>LFCLK clock running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>LFCLKSRCCOPY</name>
          <description>Clock source for the LFCLK clock, set when task LKCLKSTART is triggered.</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>Clock source for the LFCLK clock, set when task LKCLKSTART is triggered.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>Internal 32KiHz RC oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>External 32KiHz crystal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>Internal 32KiHz synthesizer from HFCLK system clock.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>LFCLKSRC</name>
          <description>Clock source for the LFCLK clock.</description>
          <addressOffset>0x518</addressOffset>
          <fields>
            <field>
              <name>SRC</name>
              <description>Clock source.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>Internal 32KiHz RC oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Xtal</name>
                  <description>External 32KiHz crystal.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synth</name>
                  <description>Internal 32KiHz synthesizer from HFCLK system clock.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>CTIV</name>
          <description>Calibration timer interval.</description>
          <addressOffset>0x538</addressOffset>
          <fields>
            <field>
              <name>CTIV</name>
              <description>Calibration timer interval in 0.25s resolution.</description>
              <lsb>0</lsb> <msb>6</msb>
            </field>
          </fields>
        </register> 
        
        <register>
          <name>XTALFREQ</name>
          <description>Crystal frequency.</description>
          <addressOffset>0x550</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>XTALFREQ</name>
              <description>External Xtal frequency selection.</description>
              <lsb>0</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16MHz xtal is used as source for the HFCLK oscillator.</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32MHz xtal is used as source for the HFCLK oscillator.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register> 
