zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>MPU</name>
      <version>522</version>
      <description>Memory Protection Unit.</description>
      <groupName>MPU</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <alternatePeripheral>POWER</alternatePeripheral>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>PERR0</name>
          <description>Configuration of peripherals in mpu regions.</description>
          <addressOffset>0x528</addressOffset>
          <fields>
            <field>
              <name>POWER_CLOCK</name>
              <description>POWER_CLOCK region configuration.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADIO</name>
              <description>RADIO region configuration.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 region configuration.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI0_TWI0</name>
              <description>SPI0 and TWI0 region configuration.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1_TWI1</name>
              <description>SPI1 and TWI1 region configuration.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOTE</name>
              <description>GPIOTE region configuration.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC region configuration.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER0</name>
              <description>TIMER0 region configuration.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1</name>
              <description>TIMER1 region configuration.</description>
              <lsb>9</lsb> <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER2</name>
              <description>TIMER2 region configuration.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC0</name>
              <description>RTC0 region configuration.</description>
              <lsb>11</lsb> <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>TEMP region configuration.</description>
              <lsb>12</lsb> <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG</name>
              <description>RNG region configuration.</description>
              <lsb>13</lsb> <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECB</name>
              <description>ECB region configuration.</description>
              <lsb>14</lsb> <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCM_AAR</name>
              <description>CCM and AAR region configuration.</description>
              <lsb>15</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT region configuration.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC1</name>
              <description>RTC1 region configuration.</description>
              <lsb>17</lsb> <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDEC</name>
              <description>QDEC region configuration.</description>
              <lsb>18</lsb> <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCOMP</name>
              <description>LPCOMP region configuration.</description>
              <lsb>19</lsb> <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVMC</name>
              <description>NVMC region configuration.</description>
              <lsb>30</lsb> <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPI</name>
              <description>PPI region configuration.</description>
              <lsb>31</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRegion0</name>
                  <description>Peripheral configured in region 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InRegion1</name>
                  <description>Peripheral configured in region 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RLENR0</name>
          <description>Length of RAM region 0.</description>
          <addressOffset>0x52C</addressOffset>
        </register>
        
