zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
        <register>
          <name>RXADDRESSES</name>
          <description>Receive address select.</description>
          <addressOffset>0x530</addressOffset>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>Enable reception on logical address 0. Decision point: START task.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR1</name>
              <description>Enable reception on logical address 1. Decision point: START task.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR2</name>
              <description>Enable reception on logical address 2. Decision point: START task.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR3</name>
              <description>Enable reception on logical address 3. Decision point: START task.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR4</name>
              <description>Enable reception on logical address 4. Decision point: START task.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR5</name>
              <description>Enable reception on logical address 5. Decision point: START task.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR6</name>
              <description>Enable reception on logical address 6. Decision point: START task.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR7</name>
              <description>Enable reception on logical address 7. Decision point: START task.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Reception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Reception enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCNF</name>
          <description>CRC configuration.</description>
          <addressOffset>0x534</addressOffset>
          <fields>
            <field>
              <name>LEN</name>
              <description>CRC length. Decision point: START task.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC calculation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>One</name>
                  <description>One byte long CRC.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>Two bytes long CRC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Three</name>
                  <description>Three bytes long CRC.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPADDR</name>
              <description>Leave packet address field out of the CRC calculation. Decision point: START task.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Include packet address in CRC calculation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Skip</name>
                  <description>Packet address is skipped in CRC calculation. The CRC calculation will start at the first byte after the address.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial.</description>
          <addressOffset>0x538</addressOffset>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial. Decision point: START task.</description>
              <lsb>0</lsb> <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value.</description>
          <addressOffset>0x53C</addressOffset>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>Initial value for CRC calculation. Decision point: START task.</description>
              <lsb>0</lsb> <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Test features enable register.</description>
          <addressOffset>0x540</addressOffset>
          <fields>
            <field>
              <name>CONSTCARRIER</name>
              <description>Constant carrier. Decision point: TXEN task.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Constant carrier disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Constant carrier enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLLOCK</name>
              <description>PLL lock. Decision point: TXEN or RXEN task.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>PLL lock disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>PLL lock enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>TIFS</name>
          <description>Inter Frame Spacing in microseconds.</description>
          <addressOffset>0x544</addressOffset>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Inter frame spacing in microseconds. Decision point: START rask</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>

        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample result. The result is read as a positive value so that ReceivedSignalStrength = -RSSISAMPLE dBm</description>
              <lsb>0</lsb> <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state.</description>
          <addressOffset>0x550</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state.</description>
              <lsb>0</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Radio is in the Disabled state.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>Radio is in the Rx Ramp Up state.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>Radio is in the Rx Idle state.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>Radio is in the Rx state.</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>Radio is in the Rx Disable state.</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>Radio is in the Tx Ramp Up state.</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>Radio is in the Tx Idle state.</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>Radio is in the Tx state.</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>Radio is in the Tx Disable state.</description>
                  <value>0x0C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value.</description>
          <addressOffset>0x554</addressOffset>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <description>Data whitening initial value. Bit 0 corresponds to Position 0 of the LSFR, Bit 1 to position 5... Decision point: TXEN or RXEN task.</description>
              <lsb>0</lsb> <msb>6</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>BCC</name>
          <description>Bit counter compare.</description>
          <addressOffset>0x560</addressOffset>
        </register>

        <register>
          <dim>8</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>DAB[%s]</name>
          <description>Device address base segment.</description>
          <addressOffset>0x600</addressOffset>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>DAP[%s]</name>
          <description>Device address prefix.</description>
          <addressOffset>0x620</addressOffset>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix.</description>
              <lsb>0</lsb> <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration.</description>
          <addressOffset>0x640</addressOffset>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0.</description>
              <lsb>8</lsb> <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1.</description>
              <lsb>9</lsb> <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2.</description>
              <lsb>10</lsb> <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3.</description>
              <lsb>11</lsb> <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4.</description>
              <lsb>12</lsb> <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5.</description>
              <lsb>13</lsb> <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6.</description>
              <lsb>14</lsb> <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7.</description>
              <lsb>15</lsb> <msb>15</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>OVERRIDE0</name>
          <description>Trim value override register 0.</description>
          <addressOffset>0x724</addressOffset>
          <fields>
            <field>
              <name>OVERRIDE0</name>
              <description>Trim value override 0.</description>
              <lsb>0</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDE1</name>
          <description>Trim value override register 1.</description>
          <addressOffset>0x728</addressOffset>
          <fields>
            <field>
              <name>OVERRIDE1</name>
              <description>Trim value override 1.</description>
              <lsb>0</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDE2</name>
          <description>Trim value override register 2.</description>
          <addressOffset>0x72C</addressOffset>
          <fields>
            <field>
              <name>OVERRIDE2</name>
              <description>Trim value override 2.</description>
              <lsb>0</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
