zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>TEMP</name>
      <version>522</version>
      <description>Temperature Sensor.</description>
      <groupName>TEMP</groupName>
      <baseAddress>0x4000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>TEMP</name>
        <value>12</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start temperature measurement.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop temperature measurement.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_DATARDY</name>
          <description>Temperature measurement complete, data ready event.</description>
          <addressOffset>0x100</addressOffset>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Enable interrupt on DATARDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>DATARDY</name>
              <description>Disable interrupt on DATARDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>TEMP</name>
          <description>Die temperature in degC, 2's complement format, 0.25 degC pecision.</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>

    <peripheral>
      <name>RNG</name>
      <version>522</version>
      <description>Random Number Generator.</description>
      <baseAddress>0x4000D000</baseAddress>
      <groupName>RNG</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>RNG</name>
        <value>13</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start the random number generator.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop the random number generator.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_VALRDY</name>
          <description>New random number generated and written to VALUE register.</description>
          <addressOffset>0x100</addressOffset>
        </register>

        <register>
          <name>SHORTS</name>
          <description>Shortcuts for the RNG.</description>
          <addressOffset>0x200</addressOffset>
          <fields>
            <field>
              <name>VALRDY_STOP</name>
              <description>Shortcut between VALRDY event and STOP task.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shortcut disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shortcut enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>VALRDY</name>
              <description>Enable interrupt on VALRDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>VALRDY</name>
              <description>Disable interrupt on VALRDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CONFIG</name>
          <description>Configuration register.</description>
          <addressOffset>0x504</addressOffset>
          <fields>
            <field>
              <name>DERCEN</name>
              <description>Digital error correction enable.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Digital error correction disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Digital error correction enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>VALUE</name>
          <description>RNG random number.</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Generated random number.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
