zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>WDT</name>
      <version>522</version>
      <description>Watchdog Timer.</description>
      <groupName>WDT</groupName>
      <baseAddress>0x40010000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>WDT</name>
        <value>16</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start the watchdog.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_TIMEOUT</name>
          <description>Watchdog timeout.</description>
          <addressOffset>0x100</addressOffset>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Enable interrupt on TIMEOUT event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Disable interrupt on TIMEOUT event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RUNSTATUS</name>
          <description>Watchdog running status.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUNSTATUS</name>
              <description>Watchdog running status.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRunning</name>
                  <description>Watchdog timer is not running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Running</name>
                  <description>Watchdog timer is running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>REQSTATUS</name>
          <description>Request status.</description>
          <addressOffset>0x404</addressOffset>
          <resetValue>0x00000001</resetValue>
          <access>read-only</access>
          <fields>
            <field>
              <name>RR0</name>
              <description>Request status for RR[0].</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[0] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[0] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR1</name>
              <description>Request status for RR[1].</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[1] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[1] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR2</name>
              <description>Request status for RR[2].</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[2] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[2] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR3</name>
              <description>Request status for RR[3].</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[3] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[3] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR4</name>
              <description>Request status for RR[4].</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[4] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[4] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR5</name>
              <description>Request status for RR[5].</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[5] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[5] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR6</name>
              <description>Request status for RR[6].</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[6] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[6] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR7</name>
              <description>Request status for RR[7].</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[7] register is not enabled or has already requested reload.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[7] register is enabled and has not jet requested.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CRV</name>
          <description>Counter reload value in number of 32kiHz clock cycles.</description>
          <addressOffset>0x504</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>

        <register>
          <name>RREN</name>
          <description>Reload request enable.</description>
          <addressOffset>0x508</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RR0</name>
              <description>Enable or disable RR[0] register.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[0] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[0] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR1</name>
              <description>Enable or disable RR[1] register.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[1] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[1] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR2</name>
              <description>Enable or disable RR[2] register.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[2] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[2] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR3</name>
              <description>Enable or disable RR[3] register.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[3] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[3] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR4</name>
              <description>Enable or disable RR[4] register.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[4] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[4] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR5</name>
              <description>Enable or disable RR[5] register.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[5] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[5] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR6</name>
              <description>Enable or disable RR[6] register.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[6] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[6] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR7</name>
              <description>Enable or disable RR[7] register.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RR[7] register is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>RR[7] register is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CONFIG</name>
          <description>Configuration register.</description>
          <addressOffset>0x50C</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>Configure the watchdog to pause or not while the CPU is sleeping.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pause</name>
                  <description>Pause watchdog while the CPU is asleep.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Run</name>
                  <description>Do not pause watchdog while the CPU is asleep.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Configure the watchdog to pause or not while the CPU is halted by the debugger.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pause</name>
                  <description>Pause watchdog while the CPU is halted by the debugger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Run</name>
                  <description>Do not pause watchdog while the CPU is halted by the debugger.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <dim>8</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>RR[%s]</name>
          <description>Reload requests registers.</description>
          <addressOffset>0x600</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RR</name>
              <description>Reload register.</description>
              <lsb>0</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Reload</name>
                  <description>Value to request a reload of the watchdog timer.</description>
                  <value>0x6E524635</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

