zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral derivedFrom="RTC0">
      <name>RTC1</name>
      <version>522</version>
      <description>Real time counter 1.</description>
      <baseAddress>0x40011000</baseAddress>
      <groupName>RTC</groupName>
      <size>32</size>
      <access>read-write</access>
      <interrupt>
        <name>RTC1</name>
        <value>17</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>QDEC</name>
      <version>522</version>
      <description>Rotary decoder.</description>
      <groupName>QDEC</groupName>
      <baseAddress>0x40012000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>QDEC</name>
        <value>18</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start the quadrature decoder.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop the quadrature decoder.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_READCLRACC</name>
          <description>Transfers the content from ACC registers to ACCREAD registers, and clears the ACC registers.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_SAMPLERDY</name>
          <description>A new sample is written to the sample register.</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <register>
          <name>EVENTS_REPORTRDY</name>
          <description>REPORTPER number of samples accumulated in ACC register, and ACC register different than zero.</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <register>
          <name>EVENTS_ACCOF</name>
          <description>ACC or ACCDBL register overflow.</description>
          <addressOffset>0x108</addressOffset>
        </register>

        <register>
          <name>SHORTS</name>
          <description>Shortcuts for the QDEC.</description>
          <addressOffset>0x200</addressOffset>
          <fields>
            <field>
              <name>REPORTRDY_READCLRACC</name>
              <description>Shortcut between REPORTRDY event and READCLRACC task.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shortcut disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shortcut enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLERDY_STOP</name>
              <description>Shortcut between SAMPLERDY event and STOP task.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shortcut disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shortcut enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>SAMPLERDY</name>
              <description>Enable interrupt on SAMPLERDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY</name>
              <description>Enable interrupt on REPORTRDY event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCOF</name>
              <description>Enable interrupt on ACCOF event.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>SAMPLERDY</name>
              <description>Disable interrupt on SAMPLERDY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY</name>
              <description>Disable interrupt on REPORTRDY event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCOF</name>
              <description>Disable interrupt on ACCOF event.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ENABLE</name>
          <description>Enable the QDEC.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable QDEC.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled QDEC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable QDEC.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>LEDPOL</name>
          <description>LED output pin polarity.</description>
          <addressOffset>0x504</addressOffset>
          <fields>
            <field>
              <name>LEDPOL</name>
              <description>LED output pin polarity.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>LED output is active low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>LED output is active high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SAMPLEPER</name>
          <description>Sample period.</description>
          <addressOffset>0x508</addressOffset>
          <fields>
            <field>
              <name>SAMPLEPER</name>
              <description>Sample period.</description>
              <lsb>0</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128us</name>
                  <description>128us sample period.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256us</name>
                  <description>256us sample period.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512us</name>
                  <description>512us sample period.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024us</name>
                  <description>1024us sample period.</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048us</name>
                  <description>2048us sample period.</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096us</name>
                  <description>4096us sample period.</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192us</name>
                  <description>8192us sample period.</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16384us</name>
                  <description>16384us sample period.</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>SAMPLE</name>
          <description>Motion sample value.</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
          <fields>
            <field>
              <name>SAMPLE</name>
              <description>Last sample taken in compliment to 2.</description>
              <lsb>0</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>REPORTPER</name>
          <description>Number of samples to generate an EVENT_REPORTRDY.</description>
          <addressOffset>0x510</addressOffset>
          <fields>
            <field>
              <name>REPORTPER</name>
              <description>Number of samples to generate an EVENT_REPORTRDY.</description>
              <lsb>0</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10Smpl</name>
                  <description>10 samples per report.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40Smpl</name>
                  <description>40 samples per report.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80Smpl</name>
                  <description>80 samples per report.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>120Smpl</name>
                  <description>120 samples per report.</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>160Smpl</name>
                  <description>160 samples per report.</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200Smpl</name>
                  <description>200 samples per report.</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>240Smpl</name>
                  <description>240 samples per report.</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>280Smpl</name>
                  <description>280 samples per report.</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ACC</name>
          <description>Accumulated valid transitions register.</description>
          <addressOffset>0x514</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
        </register>
        
        <register>
          <name>ACCREAD</name>
          <description>Snapshot of ACC register. Value generated by the TASKS_READCLEACC task.</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
        </register>

        <register>
          <name>PSELLED</name>
          <description>Pin select for LED output.</description>
          <addressOffset>0x51C</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELA</name>
          <description>Pin select for phase A input.</description>
          <addressOffset>0x520</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELB</name>
          <description>Pin select for phase B input.</description>
          <addressOffset>0x524</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>

        <register>
          <name>DBFEN</name>
          <description>Enable debouncer input filters.</description>
          <addressOffset>0x528</addressOffset>
          <fields>
            <field>
              <name>DBFEN</name>
              <description>Enable debounce input filters.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debounce input filters disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debounce input filters enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>LEDPRE</name>
          <description>Time LED is switched ON before the sample.</description>
          <addressOffset>0x540</addressOffset>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>LEDPRE</name>
              <description>Period in us the LED in switched on prior to sampling.</description>
              <lsb>0</lsb> <msb>8</msb>
            </field>
          </fields>
        </register>

        <register>
          <name>ACCDBL</name>
          <description>Accumulated double (error) transitions register.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACCDBL</name>
              <description>Accumulated double (error) transitions.</description>
              <lsb>0</lsb> <msb>3</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>ACCDBLREAD</name>
          <description>Snapshot of ACCDBL register. Value generated by the TASKS_READCLEACC task.</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACCDBLREAD</name>
              <description>Snapshot of accumulated double (error) transitions.</description>
              <lsb>0</lsb> <msb>3</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

