zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>CHG[%s]</name>
          <description>Channel group configuration.</description>
          <addressOffset>0x800</addressOffset>
          <fields>
            <field>
              <name>CH0</name>
              <description>Include CH0 in channel group.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1</name>
              <description>Include CH1 in channel group.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2</name>
              <description>Include CH2 in channel group.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3</name>
              <description>Include CH3 in channel group.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4</name>
              <description>Include CH4 in channel group.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5</name>
              <description>Include CH5 in channel group.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6</name>
              <description>Include CH6 in channel group.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7</name>
              <description>Include CH7 in channel group.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH8</name>
              <description>Include CH8 in channel group.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH9</name>
              <description>Include CH9 in channel group.</description>
              <lsb>9</lsb> <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH10</name>
              <description>Include CH10 in channel group.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH11</name>
              <description>Include CH11 in channel group.</description>
              <lsb>11</lsb> <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH12</name>
              <description>Include CH12 in channel group.</description>
              <lsb>12</lsb> <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH13</name>
              <description>Include CH13 in channel group.</description>
              <lsb>13</lsb> <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH14</name>
              <description>Include CH14 in channel group.</description>
              <lsb>14</lsb> <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH15</name>
              <description>Include CH15 in channel group.</description>
              <lsb>15</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH20</name>
              <description>Include CH20 in channel group.</description>
              <lsb>20</lsb> <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH21</name>
              <description>Include CH21 in channel group.</description>
              <lsb>21</lsb> <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH22</name>
              <description>Include CH22 in channel group.</description>
              <lsb>22</lsb> <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH23</name>
              <description>Include CH23 in channel group.</description>
              <lsb>23</lsb> <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH24</name>
              <description>Include CH24 in channel group.</description>
              <lsb>24</lsb> <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH25</name>
              <description>Include CH25 in channel group.</description>
              <lsb>25</lsb> <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH26</name>
              <description>Include CH26 in channel group.</description>
              <lsb>26</lsb> <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH27</name>
              <description>Include CH27 in channel group.</description>
              <lsb>27</lsb> <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH28</name>
              <description>Include CH28 in channel group.</description>
              <lsb>28</lsb> <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH29</name>
              <description>Include CH29 in channel group.</description>
              <lsb>29</lsb> <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH30</name>
              <description>Include CH30 in channel group.</description>
              <lsb>30</lsb> <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH31</name>
              <description>Include CH31 in channel group.</description>
              <lsb>31</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Channel excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Channel included.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
          
