zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>FICR</name>
      <version>522</version>
      <description>Factory Information Configuration.</description>
      <groupName>FICR</groupName>
      <baseAddress>0x10000000</baseAddress>
      <size>32</size>
      <access>read-only</access>
      <resetValue>0xFFFFFFFF</resetValue>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CODEPAGESIZE</name>
          <description>Code memory page size in bytes.</description>
          <addressOffset>0x010</addressOffset>
        </register>
        <register>
          <name>CODESIZE</name>
          <description>Code memory size in pages.</description>
          <addressOffset>0x014</addressOffset>
        </register>
      
        <register>
          <name>CLENR0</name>
          <description>Length of code region 0 in bytes.</description>
          <addressOffset>0x028</addressOffset>
        </register>
        <register>
          <name>PPFC</name>
          <description>Pre-programmed factory code present.</description>
          <addressOffset>0x02C</addressOffset>
          <fields>
            <field>
              <name>PPFC</name>
              <description>Pre-programmed factory code present.</description>
              <lsb>0</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Not present.</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>NUMRAMBLOCK</name>
          <description>Number of individualy controllable RAM blocks.</description>
          <addressOffset>0x034</addressOffset>
        </register>
        <register>
          <name>SIZERAMBLOCKS</name>
          <description>Size of RAM blocks in bytes.</description>
          <addressOffset>0x038</addressOffset>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>SIZERAMBLOCK[%s]</name>
          <description>Deprecated array of size of RAM block in bytes. This name is kept for backward compatinility purposes. Use SIZERAMBLOCKS instead.</description>
          <addressOffset>0x038</addressOffset>
          <alternateRegister>SIZERAMBLOCKS</alternateRegister>
        </register>
        
        <register>
          <name>CONFIGID</name>
          <description>Configuration identifier.</description>
          <addressOffset>0x05C</addressOffset>
          <fields>
            <field>
              <name>HWID</name>
              <description>Hardware Identification Number.</description>
              <lsb>0</lsb> <msb>15</msb>
            </field>
            <field>
              <name>FWID</name>
              <description>Firmware Identification Number pre-loaded into the flash.</description>
              <lsb>16</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>

        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>DEVICEID[%s]</name>
          <description>Device identifier.</description>
          <addressOffset>0x060</addressOffset>
        </register>
        
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>ER[%s]</name>
          <description>Encryption root.</description>
          <addressOffset>0x080</addressOffset>
        </register>
        
        <register>
          <dim>4</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>IR[%s]</name>
          <description>Identity root.</description>
          <addressOffset>0x090</addressOffset>
        </register>
        
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type.</description>
          <addressOffset>0x0A0</addressOffset>
           <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <dim>2</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>DEVICEADDR[%s]</name>
          <description>Device address.</description>
          <addressOffset>0x0A4</addressOffset>
        </register>
        
        <register>
          <name>OVERRIDEEN</name>
          <description>Radio calibration override enable.</description>
          <addressOffset>0x0AC</addressOffset>
          <fields>
          <field>
              <name>NRF_1MBIT</name>
              <description>Override default values for NRF_1Mbit mode.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Override</name>
                  <description>Override the default values for NRF_1Mbit mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotOverride</name>
                  <description>Do not override the default values for NRF_1Mbit mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_1MBIT</name>
              <description>Override default values for BLE_1Mbit mode.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Override</name>
                  <description>Override the default values for BLE_1Mbit mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotOverride</name>
                  <description>Do not override the default values for BLE_1Mbit mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <dim>5</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>NRF_1MBIT[%s]</name>
          <description>Override values for the OVERRIDEn registers in RADIO for NRF_1Mbit mode.</description>
          <addressOffset>0x0B0</addressOffset>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>BLE_1MBIT[%s]</name>
          <description>Override values for the OVERRIDEn registers in RADIO for BLE_1Mbit mode.</description>
          <addressOffset>0x0EC</addressOffset>
        </register>
        
