zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf51.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>UICR</name>
      <version>522</version>
      <description>User Information Configuration.</description>
      <groupName>UICR</groupName>
      <baseAddress>0x10001000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <resetValue>0xFFFFFFFF</resetValue>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CLENR0</name>
          <description>Length of code region 0.</description>
          <addressOffset>0x000</addressOffset>
        </register>
        
        <register>
          <name>RBPCONF</name>
          <description>Readback protection configuration.</description>
          <addressOffset>0x004</addressOffset>
          <fields>
            <field>
              <name>PR0</name>
              <description>Readback protect region 0. Will be ignored if pre-programmed factory code is present on the chip.</description>
              <lsb>0</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PALL</name>
              <description>Readback protect all code in the device.</description>
              <lsb>8</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled.</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>XTALFREQ</name>
          <description>Reset value for CLOCK XTALFREQ register.</description>
          <addressOffset>0x008</addressOffset>
          <fields>
            <field>
              <name>XTALFREQ</name>
              <description>Reset value for CLOCK XTALFREQ register.</description>
              <lsb>0</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16MHz</name>
                  <description>16MHz Xtal is used.</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32MHz</name>
                  <description>32MHz Xtal is used.</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>FWID</name>
          <description>Firmware ID.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FWID</name>
              <description>Identification number for the firmware loaded into the chip.</description>
              <lsb>0</lsb> <msb>15</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>BOOTLOADERADDR</name>
          <description>Bootloader start address.</description>
          <addressOffset>0x014</addressOffset>
        </register>
        
        <register>
          <dim>15</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>NRFFW[%s]</name>
          <description>Reserved for Nordic firmware design.</description>
          <addressOffset>0x014</addressOffset>
          <alternateRegister>BOOTLOADERADDR</alternateRegister>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>NRFHW[%s]</name>
          <description>Reserved for Nordic hardware design.</description>
          <addressOffset>0x050</addressOffset>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x04</dimIncrement>
          <name>CUSTOMER[%s]</name>
          <description>Reserved for customer.</description>
          <addressOffset>0x080</addressOffset>
        </register>
        
      </registers>
    </peripheral>

    <peripheral>
      <name>GPIO</name>
      <version>522</version>
      <description>General purpose input and output.</description>
      <baseAddress>0x50000000</baseAddress>
      <groupName>GPIO</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>OUT</name>
          <description>Write GPIO port.</description>
          <addressOffset>0x504</addressOffset>
          <fields>
            <field>
              <name>PIN0</name>
              <description>Pin 0.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN1</name>
              <description>Pin 1.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN2</name>
              <description>Pin 2.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN3</name>
              <description>Pin 3.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN4</name>
              <description>Pin 4.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN5</name>
              <description>Pin 5.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN6</name>
              <description>Pin 6.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN7</name>
              <description>Pin 7.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN8</name>
              <description>Pin 8.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN9</name>
              <description>Pin 9.</description>
              <lsb>9</lsb> <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN10</name>
              <description>Pin 10.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN11</name>
              <description>Pin 11.</description>
              <lsb>11</lsb> <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN12</name>
              <description>Pin 12.</description>
              <lsb>12</lsb> <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN13</name>
              <description>Pin 13.</description>
              <lsb>13</lsb> <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN14</name>
              <description>Pin 14.</description>
              <lsb>14</lsb> <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN15</name>
              <description>Pin 15.</description>
              <lsb>15</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN16</name>
              <description>Pin 16.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN17</name>
              <description>Pin 17.</description>
              <lsb>17</lsb> <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN18</name>
              <description>Pin 18.</description>
              <lsb>18</lsb> <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN19</name>
              <description>Pin 19.</description>
              <lsb>19</lsb> <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN20</name>
              <description>Pin 20.</description>
              <lsb>20</lsb> <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN21</name>
              <description>Pin 21.</description>
              <lsb>21</lsb> <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN22</name>
              <description>Pin 22.</description>
              <lsb>22</lsb> <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN23</name>
              <description>Pin 23.</description>
              <lsb>23</lsb> <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN24</name>
              <description>Pin 24.</description>
              <lsb>24</lsb> <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN25</name>
              <description>Pin 25.</description>
              <lsb>25</lsb> <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Pin 26.</description>
              <lsb>26</lsb> <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Pin 27.</description>
              <lsb>27</lsb> <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Pin 28.</description>
              <lsb>28</lsb> <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Pin driver is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Pin driver is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Pin 29.</description>
